Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_193-The_Prophecy_of_Sri_Mahadevi-v1.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་མཚན་འདི་དག་འཆང་བ་དང་། ཀློག་པར་བྱེད་པ་དེས་ནང་པར་ལངས་ཏེ་གཙང་མར་བྱས་ལ།
en: who is going to retain and recite these names of the tathāgatas, should rise in the morning, clean up, and,

source: སངས་རྒྱས་ཐམས་ཅད་ལ་མེ་ཏོག་དང་བདུག་པ་གསོལ་ནས་ལྷ་མོ་ཆེན་མོ་དཔལ་ལ་ཡང་ཙན་དན་གྱི་བདུག་པ་ཕུལ་ཏེ།
en: having offered flowers and incense to all the buddhas, also offer sandalwood incense to Śrī Mahādevī.

source: བཀླགས་ན་དེས་དཔལ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་ཞིང་བདེ་བ་དང་། ཡིད་བདེ་བ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་ཏེ།
en: Then, when he recites these names, all glory, all happiness and joys will be obtained.

source: ལྷ་ཐམས་ཅད་ཀྱང་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦེད་པ་བྱེད་པར་འགྱུར་ལ་དེའི་དོན་ཐམས་ཅད་ཀྱང་འགྲུབ་པར་འགྱུར་རོ།
en: The gods will all guard, protect and preserve him, and all of his purposes will be fulfilled.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་པ་མེད་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ལྷ་མོ་ཆེན་མོ་དཔལ་དེ་དང་། འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: When the Bhagavān had thus spoken, the fearless bodhisattva Avalokiteśvara, Śrī Mahādevī, the entire retinue, and the world, including gods, humans, asuras, and gandharvas, rejoiced and [678] praised the words of the Bhagavān.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Bodhisattva Mahāsattva Ārya Avalokiteśvara asked the Bhagavān,

source: །བཅོམ་ལྡན་འདས་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱིས་དགེ་བའི་རྩ་བ་གང་དུ་བསྐྱེད་ལགས།
en: Bhagavān, where did Śrī Mahādevī generate her roots of virtue?

source: ལྷ་མོ་ཆེན་མོ་དཔལ་གྱིས་ནི་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ།
en: Śrī Mahādevī generated roots of virtue in the presence of tathāgatas as numerous as the grains of sand of the River Ganges.
